In [ ]:
"""Write a Python program to create and display a one-
dimensional array-like object containing an array of data using

Pandas module."""

In [1]:
import numpy as np

In [10]:
import pandas as pd

In [23]:
arr=np.array([1,2,3,4,5,6,7])
ser1=pd.Series(arr)

In [24]:
print(ser1,type(ser1))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int32 <class 'pandas.core.series.Series'>

In [25]:
"""Write a Python program to convert a Panda module Series to
Python list and its type."""


ser1_list=ser1.to_list()
print(ser1_list,type(ser1_list))

[1, 2, 3, 4, 5, 6, 7] <class 'list'>

In [26]:
"""Write a Python program to add, subtract, multiple and divide
two Pandas Series."""

ser1=pd.Series(np.random.randint(10,100,8))

In [29]:
ser1.values

array([52, 80, 38, 91, 12, 33, 11, 90])

In [30]:
ser2=pd.Series(np.random.randint(10,100,10))
ser2.values

array([66, 52, 30, 83, 22, 63, 36, 38, 79, 51])

In [37]:
print("Series addition:",ser1+ser2,"Series sub:",ser1-ser2,"Series multiplication:",ser1*ser2,"Series division:",ser1/ser2,sep='\n\n\n')

Series addition:


0    118.0
1    132.0
2     68.0
3    174.0
4     34.0
5     96.0
6     47.0
7    128.0
8      NaN
9      NaN
dtype: float64


Series sub:


0   -14.0
1    28.0
2     8.0
3     8.0
4   -10.0
5   -30.0
6   -25.0
7    52.0
8     NaN
9     NaN
dtype: float64


Series multiplication:


0    3432.0
1    4160.0
2    1140.0
3    7553.0
4     264.0
5    2079.0
6     396.0
7    3420.0
8       NaN
9       NaN
dtype: float64


Series division:


0    0.787879
1    1.538462
2    1.266667
3    1.096386
4    0.545455
5    0.523810
6    0.305556
7    2.368421
8         NaN
9         NaN
dtype: float64

In [49]:
"""Write a Python program to compare the elements of the two
Pandas Series."""

ser1=pd.Series([2,3,4,15,6])
ser2=pd.Series([6,7,8,9,10])

In [50]:
ser1

0     2
1     3
2     4
3    15
4     6
dtype: int64

In [51]:
ser2

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [52]:
ser1>ser2

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [53]:
ser1<ser2

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [ ]:
"""ï‚· Write a Python program to display the following data column
wise."""

In [111]:
"""Write a Python program to create and display a Data Frame
from a specified dictionary data which has the index labels."""

data={"name":["Archana","Suma","Raghav","Kumar"],"id":[1001,1002,1003,5008],"place":["Bang","Hyd","Kolkata","Mumbai"],"course":["Eng","Math","Sciology",None]}

In [112]:
data_df=pd.DataFrame(data,index=['S1','S2','S3','S4'])

In [113]:
type(data_df)

pandas.core.frame.DataFrame

In [114]:
print(data_df)

       name    id    place    course
S1  Archana  1001     Bang       Eng
S2     Suma  1002      Hyd      Math
S3   Raghav  1003  Kolkata  Sciology
S4    Kumar  5008   Mumbai      None

In [115]:
print(data_df.loc['S4','id'])#get id of E4

5008

In [116]:
data_df['id']#diaplay only ids

S1    1001
S2    1002
S3    1003
S4    5008
Name: id, dtype: int64

In [117]:
#dispaly details of Archana
data_df.loc['S1']

name      Archana
id           1001
place        Bang
course        Eng
Name: S1, dtype: object

In [118]:
#dispaly details of Archana
data_df.iloc[0]

name      Archana
id           1001
place        Bang
course        Eng
Name: S1, dtype: object

In [119]:
data_df[data_df['name']=='Archana']

       name    id place course
S1  Archana  1001  Bang    Eng

In [ ]:
"""ï‚· Write a Python program to select the rows the score is between
15 and 20 (inclusive)."""

In [120]:
data_df['score']=[5,10,12,15]

In [121]:
data_df

       name    id    place    course  score
S1  Archana  1001     Bang       Eng      5
S2     Suma  1002      Hyd      Math     10
S3   Raghav  1003  Kolkata  Sciology     12
S4    Kumar  5008   Mumbai      None     15

In [122]:
data_df[(data_df['score']>=10) & (data_df['score']<=15)]

      name    id    place    course  score
S2    Suma  1002      Hyd      Math     10
S3  Raghav  1003  Kolkata  Sciology     12
S4   Kumar  5008   Mumbai      None     15

In [157]:
df2=pd.DataFrame({"name": ['Spoorti'], "id": [5009], "place": ['Pune'], "course": ['Eng'], "score": [17]},index=['S5'])

In [158]:
df2

       name    id place course  score
S5  Spoorti  5009  Pune    Eng     17

In [159]:
data_df=pd.concat([data_df,df2])

In [160]:
data_df

       name    id    place    course  score  no_attempts
S1  Archana  1001     Bang       Eng      5          1.0
S2     Suma  1002      Hyd      Math     10          2.0
S3   Raghav  1003  Kolkata  Sciology     12          1.0
S4    Kumar  5008   Mumbai      None     15          1.0
S5  Spoorti  5009     Pune       Eng     17          NaN

In [ ]:
"""Write a Python program to select the rows where number of
attempts in the examination is less than 2 and score greater than
15."""

In [161]:
data_df["no_attempts"]=[1,2,1,1,1]

In [162]:
data_df[(data_df["no_attempts"]<2) & (data_df['score']>15)]

       name    id place course  score  no_attempts
S5  Spoorti  5009  Pune    Eng     17            1

In [ ]:
"""Write a Python program to append a new row 'k' to Data Frame
with given values for each column. Now delete the new row and
return the original data frame."""

In [169]:
data_df.columns

Index(['name', 'id', 'place', 'course', 'score', 'no_attempts'], dtype='object')

In [173]:
df3=pd.DataFrame([["Gauri",600,"Bang","IT",20,3]],columns=['name', 'id', 'place', 'course', 'score', 'no_attempts'],index=['S6'])

In [174]:
df3

     name   id place course  score  no_attempts
S6  Gauri  600  Bang     IT     20            3

In [176]:
data_df=pd.concat([data_df,df3])

In [177]:
data_df

       name    id    place    course  score  no_attempts
S1  Archana  1001     Bang       Eng      5            1
S2     Suma  1002      Hyd      Math     10            2
S3   Raghav  1003  Kolkata  Sciology     12            1
S4    Kumar  5008   Mumbai      None     15            1
S5  Spoorti  5009     Pune       Eng     17            1
S6    Gauri   600     Bang        IT     20            3

In [ ]:
"""Now delete the new row and
return the original data frame."""

In [188]:
data_df.drop(index='S6',inplace=True)

In [189]:
data_df

       name    id    place    course  score  no_attempts
S1  Archana  1001     Bang       Eng      5            1
S2     Suma  1002      Hyd      Math     10            2
S3   Raghav  1003  Kolkata  Sciology     12            1
S4    Kumar  5008   Mumbai      None     15            1
S5  Spoorti  5009     Pune       Eng     17            1

In [190]:
"""Write a Python program to sort the data frame first by 'name' in
descending order, then by 'score' in ascending order."""

data_df.sort_values(by=['name','score'],ascending=True)

       name    id    place    course  score  no_attempts
S1  Archana  1001     Bang       Eng      5            1
S4    Kumar  5008   Mumbai      None     15            1
S3   Raghav  1003  Kolkata  Sciology     12            1
S5  Spoorti  5009     Pune       Eng     17            1
S2     Suma  1002      Hyd      Math     10            2

In [194]:
"""Write a Python program to insert a new column in existing Data
Frame."""

data_df['grade']=data_df['score']>10
data_df

       name    id    place    course  score  no_attempts  grade
S1  Archana  1001     Bang       Eng      5            1  False
S2     Suma  1002      Hyd      Math     10            2  False
S3   Raghav  1003  Kolkata  Sciology     12            1   True
S4    Kumar  5008   Mumbai      None     15            1   True
S5  Spoorti  5009     Pune       Eng     17            1   True

In [200]:
"""Write a Python program to change the name 'James' to 'Suresh'
in name column of the data frame."""

data_df.loc['S6']=["James",6000,"Pune","Law",10,1,True]
data_df.loc['S6',"name"]="Suresh"
data_df

       name    id    place    course  score  no_attempts  grade
S1  Archana  1001     Bang       Eng      5            1  False
S2     Suma  1002      Hyd      Math     10            2  False
S3   Raghav  1003  Kolkata  Sciology     12            1   True
S4    Kumar  5008   Mumbai      None     15            1   True
S5  Spoorti  5009     Pune       Eng     17            1   True
S6   Suresh  6000     Pune       Law     10            1   True